#include <iostream>
#include <cmath>
using namespace std;
int main()
{
    setlocale(LC_ALL, "ru");
    double r, k, b, x1, y1, x2, y2, d, a, b1, c;
    cout << "Введите радиус окружности R ";
    cin >> r;
    cout << "Введите коэффициенты уравнения прямой k,b ";
    cin >> k >> b;
    a = (k * k) + 1;
    b1 = 2 * k * b;
    c = (b * b) - (r * r);
    d = (b1 * b1) - (4 * a * c);
    if (d < 0)
    {
        cout << "Точек пересечения нет ";
        return 0;
    }
    if (d == 0)
    {
        x1 = -b1 / (2 * a);
        y1 = k * x1 + b;
        cout << " Прямая касается окружности в точке x= " << x1 << " y= " << y1;
    }
    if (d > 0)
    {
    x1= (-b1 + sqrt(d)) / (2 * a);
    y1= k * x1 + b;
    x2= (-b1 - sqrt(d)) / (2 * a);
    y2= k * x2 + b;
    cout << " Прямая пересекает окружность в двух точках: x1= " << x1 << " y1=" << y1 << " x2=" << x2 << " y2" << y2;
    }
    if ((x1 > 0) && (y1 > 0))
    {
        cout << " Точка x1 в 1 четверти ";
    }
    if ((x1 < 0) && (y1 > 0))
    {
        cout << " Точка x1 во 2 четверти ";
    }
    if ((x1 < 0) && (y1 < 0))
    {
        cout << " Точка x1 в 3 четверти ";
    }
    if ((x1 > 0) && (y1 < 0))
    {
        cout << " Точка x1 в 4 четверти ";
    }
    if ((x2 > 0) && (y1 > 0))
    {
        cout << " Точка x2 в 1 четверти ";
    }
    if ((x2 < 0) && (y1 > 0))
    {
        cout << " Точка x2 во 2 четверти ";
    }
    if ((x2 < 0) && (y1 < 0))
    {
        cout << " Точка x2 в 3 четверти ";
    }
    if ((x2 > 0) && (y1 < 0))
    {
        cout << " Точка x2 в 4 четверти ";
    }
   



}